// Copyright (c) 2011 The Chromium OS Authors. All rights reserved.
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

/* Menus */
"Menu About" = "Chrome OS Image Creator について";
"Menu Prefs" = "環境設定...";
"Menu Services" = "サービス";
"Menu Hide" = "Chrome OS Image Creator を隠す";
"Menu Hide Others" = "他を隠す";
"Menu Show All" = "すべて表示";
"Menu Quit" = "Chrome OS Image Creator を終了";
"Menu Window" = "ウインドウ";
"Menu Minimize" = "最小化";
"Menu Zoom" = "拡大/縮小";
"Menu Bring All To Front" = "すべてを前面に移動";
"Menu Help" = "ヘルプ";
"Menu App Help" = "Chrome OS Image Creator ヘルプ";

/* Buttons */
"Button Previous" = "前へ";
"Button Next" = "次へ";
"Button Stop" = "停止";
"Button Done" = "完了";

/* Tab: Select device model */
"Text Welcome" = "Chrome OS Image Creator へようこそ。お使いの Chrome OS デバイスのモデルを選択してください。";
"Button Local Image" = "ローカル イメージ...";

/* Tab: Select USB stick */
"Text Select Prompt" = "リカバリに使用する USB メモリ スティックを選択してください:";
"Text Insertion Prompt" = "USB メモリ スティックを挿入してください。";

/* Tab: Done */
"Text Congrats" = "Chrome OS パソコン用リカバリ ブート ドライブの作成が完了しました。パソコンからドライブを取り外し、Chromebook のオペレーティング システムが破損した際の復旧にご利用ください。";

/* Error starting Disk Arbitration. */
"NoDiskArb Message" = "このアプリケーションは実行できません。";
"NoDiskArb Informative" = "Disk Arbitration の起動中に問題が発生しました。予期しないエラーです。";
"NoDiskArb OK" = "OK";

/* Error retrieving config file. */
"CantGetConfig Message" = "イメージ リストを取得できません。";
"CantGetConfig Informative" = "利用できるリカバリ イメージのリストの取得中に問題が発生しました（%1$@）。ネットワークの接続状況をご確認ください。";
"CantGetConfig OK" = "OK";
"CantGetConfig Error NoConnection" = "接続の割り当てに失敗しました";
"CantGetConfig Error DownloadError" = "ダウンロード中にエラーが発生しました";
"CantGetConfig Error StringCreate" = "レスポンスを使用できませんでした";

/* Version error. */
"VersionError Message" = "アプリケーションのバージョンが古くなっています。";
"VersionError Informative" = "新しいバージョンをダウンロードしてください。現在はバージョン %1$@ ですが、バージョン %2$@ 以上が必要です。%3$@";
"VersionError OK" = "新しいバージョンを取得";

/* File dialog to select a local file. */
"SelectLocal File" = "イメージを選択してください:";
"SelectLocal Button" = "選択";

/* Alert on writing stick. */
"WriteAlert Message" = "%1$@ のデータを完全に消去してもよろしいですか？";
"WriteAlert Informative" = "メディア上の現在のデータはすべて完全に消去されます。この操作は元に戻せません。";
"WriteAlert Cancel" = "消去しない";
"WriteAlert OK" = "消去する";

"TooSmallAlert Message" = "%1$@ は容量が小さすぎるため使用できません。";
"TooSmallAlert Informative" = "%2$@ 以上のメモリ スティックが必要です。";
"TooSmallAlert OK" = "OK";

"NotWritable Message" = "%1$@ は読み取り専用なので使用できません。";
"NotWritable Informative" = "このメモリ スティックは読み取り専用です。メモリ スティックのスイッチで書き込み可能に切り替えられる場合があります。それ以外の場合は使用できません。";
"NotWritable OK" = "OK";

/* Stick writing statuses. */
"Status Downloading" = "ダウンロードしています...";
"Status Verifying" = "検証しています...";
"Status Unpacking" = "解凍しています...";
"Status Claiming" = "アクセスしています...";
"Status Unmounting" = "マウントを解除しています...";
"Status Writing" = "書き込んでいます...";
"Status Ejecting" = "取り出しています...";
"Status Done" = "完了しました";

"StatusAdd Attempt" = "（%1$d 回目）";

/* Errors */
"Failure Downloading" = "エラーが発生しました（ソース イメージをダウンロードできませんでした）。もう一度実行しますか？";
"Failure Verifying Return Value" = "エラーが発生しました（ソース イメージの検証中にプログラム エラーが発生しました: %1$s）。もう一度実行しますか？";
"Failure Verifying SHA Mismatch" = "エラーが発生しました（ソース イメージの検証中にチェックサム エラーが発生しました）。もう一度実行しますか？";
"Failure Unpacking" = "エラーが発生しました（ソース イメージを解凍できませんでした: %1$s）。もう一度実行しますか？";
"Failure Claiming" = "エラーが発生しました（USB メモリ スティックにアクセスできませんでした）。もう一度実行しますか？";
"Failure Unmounting" = "エラーが発生しました（USB メモリ スティックのマウントを解除できませんでした）。もう一度実行しますか？";
"Failure Opening Source Image" = "エラーが発生しました（ソース イメージを開くことができませんでした: %1$s）。もう一度実行しますか？";
"Failure Opening Destination Device" = "エラーが発生しました（USB メモリ スティックを開くことができませんでした: %1$s）。もう一度実行しますか？";
"Failure Reading Source Image" = "エラーが発生しました（ソース イメージを読み取ることができませんでした: %1$s）。もう一度実行しますか？";
"Failure Writing Destination Device" = "エラーが発生しました（USB メモリ スティックにデータを書き込むことができませんでした: %1$s）。もう一度実行しますか？";
"Failure Ejecting" = "エラーが発生しました（USB メモリ スティックを取り出すことができませんでした）。もう一度実行しますか？";

"Failure Try Again" = "再実行";
"Failure Quit" = "終了";

"Failure Termination Status" = "終了ステータス %d";

"Failure Internal Error 1" = "予期しない EOF";
